Repository: microsoft/vs-mef
Catalog: src/Microsoft.VisualStudio.Composition.LocalizationShell/Strings.*.resx
Languages: cs, de, es, fr, it, ja, pt_br, ru, tr, zh_hant

# CannotDirectlyDisposeAnImport
source: This instance is an import and cannot be directly disposed.
cs: Toto je instance importu a nedá se přímo zrušit.
de: Diese Instanz ist ein Import und kann nicht direkt gelöscht werden.
es: Esta instancia es una importación y no se puede eliminar directamente.
fr: Cette instance est une importation et ne peut pas être supprimée directement.
it: Questa istanza è un'importazione e non può essere eliminato direttamente.
ja: このインスタンスはインポートであり、直接破棄することはできません。
pt_br: Esta instância é uma importação e não pode ser descartada diretamente.
ru: Этот экземпляр является операцией импорта и не может быть раскрыт напрямую.
tr: Bu örnek, bir içeri aktarmadır ve doğrudan bırakılamaz.
zh_hant: 這個執行個體是匯入，而且無法直接處置。

# ContainerDisposalEncounteredExceptions
source: Instantiated part(s) threw exception(s) from IDisposable.Dispose().
cs: Části v instancích vrátily výjimky z metody IDisposable.Dispose().
de: Instanziierte Teile haben Ausnahmen aus IDisposable.Dispose() ausgelöst.
es: Los elementos con instancias produjeron excepciones desde IDisposable.Dispose().
fr: La ou les parties instanciées ont levé une ou plusieurs exceptions à partir de IDisposable.Dispose().
it: Le parti di cui è stata creata un'istanza hanno generato eccezioni da IDisposable.Dispose().
ja: インスタンス化されたパーツが IDisposable.Dispose() から例外をスローしました。
pt_br: As partes instanciadas geraram exceções por meio de IDisposable.Dispose().
ru: Возникли исключения в частях с созданными экземплярами из IDisposable.Dispose().
tr: Örneği oluşturulan bölümler, IDisposable.Dispose() öğesinden özel durumlar oluşturdu.
zh_hant: 從 IDisposable.Dispose() 執行個體化的部分擲回的例外狀況。

# ErrorsDuringDiscovery
source: Errors occurred during discovery.
cs: Při zjišťování došlo k chybě.
de: Fehler bei der Ermittlung.
es: Se produjeron errores durante la detección.
fr: Des erreurs se sont produites durant la découverte.
it: Si sono verificati errori durante l'individuazione.
ja: 検出中にエラーが発生しました。
pt_br: Ocorreram erros durante a descoberta.
ru: Произошли ошибки при обнаружении.
tr: Bulma sırasında hatalar oluştu.
zh_hant: 探索期間發生錯誤。

# ErrorsInComposition
source: Errors exist in the composition.
cs: V kompozici jsou chyby.
de: Fehler in der Komposition.
es: Hay errores en la composición.
fr: Des erreurs existent dans la composition.
it: La composizione contiene errori.
ja: コンポジション内にエラーが存在します。
pt_br: Existem erros na composição.
ru: Произошли ошибки в композиции.
tr: Birleştirmede hatalar var.
zh_hant: 複合裡有錯誤。

# ErrorWhileSettingImport
source: Import "{0}" could not be satisfied.
cs: Podmínky importu {0} se nedají splnit.
de: Die Bedingungen von Import "{0}" konnten nicht erfüllt werden.
es: No se pudo completar la importación "{0}".
fr: Impossible de satisfaire l'importation de "{0}".
it: Non è possibile soddisfare l'importazione "{0}".
ja: インポート "{0}" の要件を満たせませんでした。
pt_br: Não foi possível satisfazer à importação de "{0}".
ru: Не удалось выполнить импорт "{0}".
tr: "{0}" içeri aktarması karşılanamadı.
zh_hant: 無法滿足匯入"{0}"。

# ExceptionThrownByPartUnderInitialization
source: An exception was thrown while initializing part "{0}".
cs: Při inicializaci části {0} se vrátila výjimka.
de: Während der Initialisierung von Teil "{0}" wurde eine Ausnahme ausgelöst.
es: Se produjo una excepción durante la inicialización del elemento "{0}".
fr: Une exception a été levée durant l'initialisation de la partie "{0}".
it: È stata generata un'eccezione durante l'inizializzazione della parte "{0}".
ja: パーツ "{0}" の初期化中に例外がスローされました。
pt_br: Uma exceção foi gerada ao inicializar a parte "{0}".
ru: Возникло исключение при инициализации части "{0}".
tr: "{0}" bölümü başlatılırken bir özel durum oluşturuldu.
zh_hant: 初始化組件"{0}"時，擲回例外狀況。

# ExportedValueNotAssignableToImport
source: Value exported from "{0}" cannot be assigned to import site "{1}".
cs: Hodnota exportovaná z {0} se nedá přiřadit k importované lokalitě {1}.
de: Der aus "{0}" exportierte Wert kann nicht der Importwebsite "{1}" zugewiesen werden.
es: El valor exportado desde "{0}" so se puede asignar al sitio de importación "{1}".
fr: La valeur exportée à partir de "{0}" ne peut pas être assignée au site d'importation "{1}".
it: Non è possibile assegnare il valore esportato da "{0}" al sito di importazione "{1}".
ja: "{0}" からエクスポートされた値を、サイト "{1}" のインポート用に割り当てることはできません。
pt_br: O valor exportado de "{0}" não pode ser atribuído para importar o site "{1}".
ru: Значение, экспортированное из "{0}", не может быть назначено для сайта импорта "{1}".
tr: "{0}" öğesinden dışarı aktarılan değer, "{1}" sitesine atanamaz.
zh_hant: 匯出從"{0}"的值不能指定要匯入網站"{1}"。

# FailStableComposition
source: Failed to find a stable composition.
cs: Nepovedlo se najít stabilní kompozici.
de: Fehler beim Suchen einer stabilen Komposition.
es: Se produjo un error al buscar una composición estable.
fr: Échec de la détection d'une composition stable.
it: Non sono state trovate composizioni stabili.
ja: 安定したコンポジションが見つかりませんでした。
pt_br: Falha ao localizar uma composição estável.
ru: Не удалось найти стабильную композицию.
tr: Kararlı bir birleştirme bulunamadı.
zh_hant: 無法找到穩定的組合。

# FailureWhileScanningType
source: Failure while scanning type "{0}".
cs: Při skenování typu {0} došlo k chybě.
de: Fehler beim Überprüfen von Typ "{0}".
es: Se produjo un error durante el análisis del tipo "{0}".
fr: Échec durant l'analyse du type "{0}".
it: Si è verificato un errore durante la ricerca del tipo "{0}".
ja: 型 "{0}" のスキャン中にエラーが発生しました。
pt_br: Falha ao verificar o tipo "{0}".
ru: Сбой сканирования типа "{0}".
tr: "{0}" türü taranırken hata oluştu.
zh_hant: 掃描類型"{0}"時發生失敗。

source: No importing constructor.
cs: Chybí importující konstruktor.
de: Kein importierender Konstruktor.
es: Constructor que no es de importación.
fr: Aucun constructeur d'importation.
it: Non sono stati trovati costruttori di importazione.
ja: インポート コンストラクターがありません。
pt_br: Nenhum construtor de importação.
ru: Отсутствует конструктор импорта.
tr: İçeri aktarma oluşturucusu yok.
zh_hant: 沒有匯入的建構函式。

# PartBelongsToAnotherSharingBoundary
source: Inappropriate request for export from part that belongs to another sharing boundary.
cs: Nesprávný požadavek na export z části, která spadá do jiné hranice sdílení.
de: Unzulässige Anforderung für Export aus einem Teil, der zu einer anderen freigebenden Grenze gehört.
es: Solicitud inapropiada para la exportación desde el elemento que pertenece a otro límite de uso compartido.
fr: Demande d'exportation inappropriée émise par une partie qui appartient à une autre limite de partage.
it: La richiesta di esportazione da una parte che appartiene a un altro limite di condivisione non è appropriata.
ja: 別の共有境界に属するパーツへのエクスポートに関する不適切な要求です。
pt_br: Solicitação inadequada de exportação da parte que pertence a outro limite de compartilhamento.
ru: Недопустимый запрос экспорта из части, которая принадлежит другой общей границе.
tr: Başka bir paylaşım sınırına ait olan bölümden, uygun olmayan dışarı aktarma isteği.
zh_hant: 不適當的要求，使其能從另一個共用的邊界所屬的組件的匯出。

# PartIsNotInstantiable
source: This part ({0}) cannot be instantiated.
cs: Pro tuto část ({0}) se nedají vytvořit instance.
de: Dieser Teil ({0}) kann nicht instanziiert werden.
es: No se pueden crear instancias para este elemento ({0}).
fr: Cette partie ({0}) ne peut pas être instanciée.
it: Non è possibile creare l'istanza di questa parte ({0}).
ja: このパーツ ({0}) はインスタンス化できません。
pt_br: Não é possível criar uma instância desta parte ({0}).
ru: Невозможно создать экземпляры этой части ({0}).
tr: Bu bölümün ({0}) örneği oluşturulamıyor.
zh_hant: 此組件 ({0}) 不能執行個體化。

# ReflectionTypeLoadExceptionWhileEnumeratingTypes
source: ReflectionTypeLoadException while enumerating types in assembly "{0}". Results will be incomplete.
cs: Při vytváření výčtů typů v sestavení {0} se vrátila výjimka ReflectionTypeLoadException. Výsledky nebudou úplné.
de: ReflectionTypeLoadException beim Aufzählen von Typen in der Assembly "{0}". Die Ergebnisse sind nicht vollständig.
es: ReflectionTypeLoadException durante la enumeración de tipos del ensamblado "{0}". Los resultados estarán incompletos.
fr: ReflectionTypeLoadException durant l'énumération des types dans l'assembly "{0}". Les résultats seront incomplets.
it: Si è verificata l'eccezione ReflectionTypeLoadException durante l'enumerazione dei tipi nell'assembly "{0}". I risultati saranno incompleti.
ja: アセンブリ "{0}" 内の型の列挙中に ReflectionTypeLoadException が発生しました。結果は不完全になります。
pt_br: ExceçãoDeCargaTipoReflexão ao enumerar tipos em assembly "{0}". Os resultados serão incompletos.
ru: Возникло исключение ReflectionTypeLoadException при перечислении типов в сборке "{0}". Результаты будут неполными.
tr: "{0}" bütünleştirilmiş kodundaki türlerin numaralandırılması sırasında ReflectionTypeLoadException oluştu. Sonuçlar eksik olacak.
zh_hant: 列舉型別在組件"{0}"中的 ReflectionTypeLoadException。結果會不完整。

source: Scanning MEF assemblies...
cs: Skenují se sestavení rozhraní MEF...
de: MEF-Assemblys werden überprüft...
es: Analizando los ensamblados MEF...
fr: Analyse des assemblys MEF...
it: Ricerca degli assembly MEF in corso...
ja: MEF アセンブリをスキャンしています...
pt_br: Verificando assemblies de MEF...
ru: Идет сканирование сборок MEF...
tr: MEF bütünleştirilmiş kodları taranıyor...
zh_hant: 正在掃描 MEF 組件...

# TypeOfMetadataViewUnsupported
source: Type of metadata view is unsupported.
cs: Typ zobrazení metadat není podporovaný.
de: Der Typ der Metadatenansicht wird nicht unterstützt.
es: La vista de tipo de metadatos no es compatible.
fr: Le type d'affichage de métadonnées n'est pas pris en charge.
it: Il tipo di visualizzazione metadati non è supportato.
ja: メタデータ ビューの型がサポートされていません。
pt_br: Não há suporte para o tipo de exibição de metadados.
ru: Тип представления метаданных не поддерживается.
tr: Meta veri görüntüleme türü desteklenmiyor.
zh_hant: 中繼資料檢視的型別不支援。

# UnableToDeterminePrimarySharingBoundary
source: Unable to determine the primary sharing boundary for MEF part "{0}".
cs: Nedá se určit primární hranice sdílení pro část rozhraní MEF {0}.
de: Die primäre freigebende Grenze für MEF-Part "{0}" kann nicht ermittelt werden.
es: No se pudo determinar el límite de uso compartido primario para el elemento MEF "{0}".
fr: Impossible de déterminer la limite de partage principale pour la partie MEF "{0}".
it: Non è possibile determinare il limite di condivisione primario per la parte MEF "{0}".
ja: MEF パーツ "{0}" の主な共有境界を特定できません。
pt_br: Não é possível determinar o limite de compartilhamento principal da parte de MEF "{0}".
ru: Не удалось определить первичную общую границу для части MEF "{0}".
tr: MEF bölümü "{0}" için birincil paylaşım sınırı belirlenemedi.
zh_hant: 無法判斷 MEF 組件"{0}"的主要共用界限。

# UnableToEnumerateTypes
source: Unable to enumerate types in assembly "{0}".
cs: Nedá se vytvořit výčet typů v sestavení {0}.
de: Die Typen in Assembly "{0}" können nicht aufgezählt werden.
es: No se pudieron enumerar los tipos en el ensamblado "{0}".
fr: Impossible d'énumérer les types dans l'assembly "{0}".
it: Non è possibile enumerare i tipi nell'assembly "{0}".
ja: アセンブリ "{0}" 内の型を列挙できません。
pt_br: Não é possível enumerar os tipos no assembly "{0}".
ru: Не удалось перечислить типы в сборке "{0}".
tr: "{0}" bütünleştirilmiş kodundaki türler numaralandırılamadı.
zh_hant: 無法列舉組件"{0}"中的型別。

source: Unable to instantiate custom import collection type.
cs: Nedají se vytvořit instance vlastního typu kolekce importu.
de: Der Typ der benutzerdefinierten Importsammlung kann nicht instanziiert werden.
es: No se pudieron crear instancias para el tipo de colección de importación personalizado.
fr: Impossible d'instancier le type de collection d'importation personnalisée.
it: Non è possibile creare l'istanza del tipo di raccolta di importazione personalizzato.
ja: カスタム インポート コレクション型をインスタンス化できません。
pt_br: Não é possível criar uma instância do tipo de coleção de importação personalizada.
ru: Не удалось создать экземпляр типа коллекции пользовательского импорта.
tr: Özel içeri aktarma koleksiyonu türünün örneği oluşturulamıyor.
zh_hant: 無法具現化自訂的匯入集合型別。

# UnableToLoadAssembly
source: Unable to load assembly "{0}" for scanning.
cs: Nedá se načíst sestavení {0} ke skenování.
de: Die Assembly "{0}" kann nicht für die Überprüfung geladen werden.
es: No se pudo cargar el ensamblado "{0}" para su análisis.
fr: Impossible de charger l'assembly "{0}" pour l'analyse.
it: Non è possibile caricare l'assembly "{0}" per la ricerca.
ja: スキャン用にアセンブリ "{0}" を読み込めません。
pt_br: Não é possível carregar o assembly "{0}" para verificação.
ru: Не удалось загрузить сборку "{0}" для сканирования.
tr: Tarama için "{0}" bütünleştirilmiş kodu yüklenemiyor.
zh_hant: 無法載入組件"{0}"進行掃描。

# UnexpectedMemberType
source: Unexpected member type {0}.
cs: Neočekávaný typ člena {0}
de: Unerwarteter Membertyp.
es: Tipo de miembro no esperado.
fr: Type de membre inattendu.
it: Tipo di membro imprevisto.
ja: 予期しないメンバー型です。
pt_br: Tipo de membro inesperado {0}.
ru: Неожиданный тип элемента.
tr: Beklenmeyen üye türü {0}.
zh_hant: 未預期的成員類型 {0}。

# UnexpectedNumberOfExportsFound
source: Expected {0} export(s) with contract name "{1}" but found {2} after applying applicable constraints.
cs: Očekával se následující počet exportů s názvem kontraktu {1}: {0}. Nalezený počet po použití příslušných omezení byl ale: {2}.
de: Es wurde(n) {0} Export(e) mit dem Vertragsnamen "{1}" erwartet, nach der Anwendung geltender Einschränkungen wurden jedoch {2} gefunden.
es: Se esperaban {0} exportaciones con nombre de contrato "{1}", pero se encontraron {2} después de aplicar las restricciones aplicables.
fr: {0} exportation(s) attendues avec le nom de contrat "{1}" mais {2} ont été détectées après l'application des contraintes appropriées.
it: Sono previste {0} esportazioni con nome contratto "{1}", ma ne sono state trovate {2} dopo l'applicazione dei vincoli.
ja: 契約名 "{1}" による {0} 回のエクスポートが予想されましたが、適用可能な制約の適用後に {2} が見つかりました。
pt_br: {0} exportação(ões) esperada(s) com nome de contrato "{1}", mas foram encontradas {2} após aplicação das restrições aplicáveis.
ru: Ожидаются операции экспорта ({0}) с названием контракта "{1}", но после применения соответствующих ограничений найдено {2}.
tr: Sözleşme adı "{1}" olan {0} dışarı aktarma bekleniyordu, ancak ilgili kısıtlamalar uygulandıktan sonra {2} bulundu.
zh_hant: 必須是的 {0}，export(s) 有合約名稱"{1}"，但找到的 {2} 之後套用適當的條件約束。

# UnexpectedSharedPartState
source: This shared part is in state {0} but must be in state {1} for this operation.
cs: Tato sdílená část je ve stavu {0}, pro tuto operaci ale musí být ve stavu {1}.
de: Dieser freigegebene Teil weist den Status {0} auf, muss für diesen Vorgang jedoch den Status {1} aufweisen.
es: Este elemento compartido está en estado {0}, pero debe estar en estado {1} para esta operación.
fr: Cette partie partagée est à l'état {0} mais doit être à l'état {1} pour cette opération.
it: Lo stato di questa parte condivisa è {0}, ma deve essere {1} per questa operazione.
ja: この共有済みパーツは {0} の状態ですが、この操作の場合は {1} の状態でなければなりません。
pt_br: Esta parte compartilhada está em estado {0}, mas deve estar em estado {1} para esta operação.
ru: Эта общая часть находится в состоянии {0}, но должна быть в состоянии {1} для данной операции.
tr: Bu paylaşılan bölüm {0} durumunda, ancak bu işlem için {1} durumunda olması gerekiyor.
zh_hant: 此共用的組件是在狀態為 {0}，但必須在這項作業的狀態 {1} 中。

source: All values must be non-null.
cs: Žádná hodnota nesmí být null.
de: Alle Werte müssen nicht NULL sein.
es: Todos los valores deben ser no nulos.
fr: Toutes les valeurs doivent être non null.
it: Tutti i valori devono essere non Null.
ja: 値はすべて NULL 以外でなければなりません。
pt_br: Todos os valores devem ser não nulos.
ru: Значения не должны быть равны NULL.
tr: Tüm değerler, null olmayan değer olmalıdır.
zh_hant: 所有的值必須為非 null。

# CannotImportBecauseExportingPartCannotBeInstantiated
source: {0}: cannot import exported value from {1} because the exporting part cannot be instantiated. Is it missing an importing constructor?
cs: {0}: exportovaná hodnota se nedá importovat z {1}, protože pro exportující část nejdou vytvořit instance. Chybí importující konstruktor?
de: {0}: Der exportierte Wert aus {1} kann nicht importiert werden, da der exportierende Teil nicht instanziiert werden kann. Fehlt ein importierender Konstruktor?
es: {0}: no se puede importar el valor exportado desde {1} porque no se puede crear una instancia para el elemento de exportación. ¿Falta algún constructor de importación?
fr: {0} : ne peut pas importer la valeur exportée à partir de {1}, car la partie qui exporte ne peut pas être instanciée. Est-ce qu'il lui manque un constructeur d'importation ?
it: {0}: il valore esportato da {1} non può essere importato perché non è possibile creare l'istanza della parte di esportazione. Forse manca un costruttore di importazione.
ja: {0}: エクスポートされたパーツはインスタンス化できないため、{1} からエクスポートされた値をインポートすることはできません。インポート コンストラクターが不足していますか?
pt_br: {0}: não é possível importar o valor exportado de {1} porque não é possível criar uma instância da parte de exportação. Um construtor de importação está ausente?
ru: {0}: невозможно импортировать экспортированное значение из {1}, так как не удается создать экземпляр экспортируемой части. Возможно, отсутствует импортирующий конструктор.
tr: Dışarı aktarılan bölümün örneği oluşturulamadığından, {0}, {1} öğesinden dışarı aktarılan değeri içeri aktaramıyor. Önemli bir oluşturucusu mu eksik?
zh_hant: {0}︰ 無法匯入匯出值從 {1} 因為匯出的組件無法具現化。它是否有遺漏匯入的建構函式？

# CollectionTypeMustDeriveFromICollectionOfT
source: Collection type must derive from ICollection<T>.
cs: Typ kolekce musí být odvozený z rozhraní ICollection<T>.
de: Der Sammlungstyp muss von ICollection<T> abgeleitet werden.
es: El tipo de colección debe derivar de ICollection<T>.
fr: Le type Collection doit dériver de ICollection<T>.
it: Il tipo Collection deve derivare da ICollection<T>.
ja: コレクション型は ICollection<T> から派生しなければなりません。
pt_br: O tipo de coleção deve derivar de ICollection<T>.
ru: Тип коллекции должен быть производным от ICollection<T>.
tr: Koleksiyon türü ICollection<T>'den türetilmelidir.
zh_hant: 集合類型必須衍生自 ICollection<T>.

# ExactlyOneEntryForEveryImport
source: There should be exactly one entry for every import.
cs: Ke každému importu musí být právě jedna položka.
de: Für jeden Import muss genau einen Eintrag vorhanden sein.
es: Debe haber una entrada para cada importación.
fr: Il ne doit y avoir qu'une seule entrée pour chaque importation.
it: Deve esistere una sola voce per ogni importazione.
ja: インポートごとに 1 つのエントリが必要です。
pt_br: Deve haver exatamente uma entrada para cada importação.
ru: Для каждого импорта требуется только одна запись.
tr: Her içeri aktarma için tam olarak bir giriş olmalıdır.
zh_hant: 應該只有一個項目，每個匯入。

# ExpectedExactlyOneExportButFound
source: {0}: expected exactly 1 export of {1} but found {2}.{3}
cs: {0}: očekával se právě 1 export {1}, ale počet nalezených exportů je: {2}.{3}
de: {0}: Es wurde genau ein Export von {1} erwartet, es wurden jedoch {2} gefunden.{3}
es: {0}: se esperaba exactamente 1 exportación de {1}, pero se encontraron {2}.{3}
fr: {0} : une seule exportation de {1} attendue, mais détection de {2}.{3}
it: {0}: è prevista una sola esportazione di {1}, ma ne sono state trovate {2}.{3}
ja: {0}: {1} のエクスポートは 1 と予想されましたが、見つかったのは {2} です。{3}
pt_br: {0}: esperava-se exatamente 1 exportação de {1}, mas foram encontradas {2}.{3}
ru: {0}: ожидается только 1 операция экспорта {1}, но найдено {2}.{3}
tr: {0}: {1} öğesinden tam olarak 1 dışarı aktarma bekleniyordu, ancak bulunan: {2}.{3}
zh_hant: {0}: 必須是 1 個匯出的 {1}，但找到 {2}。{3}

# ExpectedOneOrZeroExportsButFound
source: {0}: expected 1 or 0 exports of {1} but found {2}.{3}
cs: {0}: očekával se 1 nebo 0 exportů {1}, ale počet nalezených exportů je: {2}.{3}
de: {0}: Es wurden 1 bzw. 0 Exporte von {1} erwartet, es wurden jedoch {2} gefunden.{3}
es: {0}: se esperaba 1 o 0 exportaciones de {1}, pero se encontraron {2}.{3}
fr: {0} : une seule ou aucune exportation de {1} attendue, mais détection de {2}.{3}
it: {0}: sono previste 1 o 0 esportazioni di {1}, ma ne sono state trovate {2}.{3}
ja: {0}: {1} のエクスポートは 1 または 0 と予想されましたが、見つかったのは {2} です。{3}
pt_br: {0}: esperava-se 1 ou 0 exportação de {1}, mas foram encontradas {2}.{3}
ru: {0}: ожидается 1 или 0 операций экспорта {1}, но найдено {2}.{3}
tr: {0}: {1} öğesinden 1 veya 0 dışarı aktarma bekleniyordu, ancak bulunan: {2}.{3}
zh_hant: {0}: 必須是 1 或 0 的 {1}，但找到 {2} 的匯出。{3}

# ExportOfExportProviderNotAllowed
source: {0}: Export of ExportProvider is not allowed.
cs: {0}: Export objektu ExportProvider není povolený.
de: {0}: Ein Export von ExportProvider ist nicht zulässig.
es: {0}: no está permitida la exportación de ExportProvider.
fr: {0} : l'exportation de ExportProvider n'est pas autorisée.
it: {0}: l'esportazione di ExportProvider non è consentita.
ja: {0}: ExportProvider のエクスポートは許可されていません。
pt_br: {0}: Não é permitida exportação do ProvedorDeExportação.
ru: {0}: экспорт ExportProvider запрещен.
tr: {0}: ExportProvider'ın dışarı aktarılmasına izin verilmiyor.
zh_hant: {0}︰ 不允許匯出的 ExportProvider。

# ImportingCtorHasUnsupportedParameterTypeForImportMany
source: Importing constructor has an unsupported parameter type for an [ImportMany]. Only T[] and IEnumerable<T> are supported.
cs: Importující konstruktor obsahuje nepodporovaný typ parametru pro [ImportMany]. Podporované jsou jenom typy T[] a IEnumerable<T>.
de: Der importierende Konstruktor weist einen nicht unterstützten Parametertyp für [ImportMany] auf. Nur T[] und IEnumerable<T> werden unterstützt.
es: El constructor de importación tiene un tipo de parámetro no compatible para [ImportMany]. Solo son compatibles T[] y IEnumerable<T>.
fr: Le constructeur d'importation a un type de paramètre non pris en charge pour [ImportMany]. Seuls T[] et IEnumerable<T> sont pris en charge.
it: Il costruttore di importazione contiene un tipo di parametro non supportato per un elemento [ImportMany]. Sono supportati solo T[] e IEnumerable<T>
ja: インポート コンストラクターには、[ImportMany] に対してサポートされていないパラメーター型があります。T[] および IEnumerable<T> のみサポートされています。
pt_br: O construtor de importação possui um tipo de parâmetro sem suporte para um [ImportarMuitos]. Somente T[] e IEnumerable<T> têm suporte.
ru: В импорте конструктора указан неподдерживаемый тип параметра для [ImportMany]. Поддерживаются только T[] и IEnumerable<T>.
tr: İçeri aktarma oluşturucusunda, [ImportMany] için desteklenmeyen bir parametre türü var. Yalnızca T[] ve IEnumerable<T> desteklenir.
zh_hant: 匯入建構函式包含 [ImportMany] 不支援的參數類型。目前只支援 T[] 及 IEnumerable<T>。

# ImportsThatUseGenericTypeParametersNotSupported
source: {0}: imports that use generic type parameters are not supported.
cs: {0}: Importy používající parametry generického typu nejsou podporované.
de: {0}: Importe, die Parameter eines generischen Typs verwenden, werden nicht unterstützt.
es: {0}: las importaciones que usan los parámetros de tipo genérico no son compatibles.
fr: {0} : les importations qui utilisent des paramètres de types génériques ne sont pas prises en charge.
it: {0}: le importazioni che usano parametri di tipo generici non sono supportate.
ja: {0}: ジェネリック型パラメーターを使用するインポートはサポートされていません。
pt_br: {0}: importações que usam parâmetros de tipo genérico não têm suporte.
ru: {0}: операции импорта, в которых используются параметры универсального типа, не поддерживаются.
tr: {0}: Genel tür parametrelerini kullanan içeri aktarmalar desteklenmez.
zh_hant: {0}︰ 不支援使用泛型型別參數的匯入。

# InstanceEmpty
source: This instance is empty.
cs: Tato instance je prázdná.
de: Diese Instanz ist leer.
es: La instancia está vacía.
fr: Cette instance est vide.
it: Questa istanza è vuota.
ja: このインスタンスは空です。
pt_br: Esta instância está vazia.
ru: Экземпляр пуст.
tr: Bu örnek boş.
zh_hant: 這個執行個體是空的。
