Repository: microsoft/vs-mef
Catalog: src/Microsoft.VisualStudio.Composition.LocalizationShell/Strings.*.resx
Languages: cs, de, es, fr, it, ja, pt_br, ru, tr, zh_hant

# IsNotAssignableFromExportedMEFValue
source: {0}: is not assignable from exported MEF value {1}.
cs: {0}: Nedá se přiřadit z exportované hodnoty rozhraní MEF {1}.
de: {0} kann nicht aus dem exportierten MEF-Wert {1} zugewiesen werden.
es: {0}: no se puede asignar desde el valor MEF exportado {1}.
fr: {0} : ne peut pas être assigné à partir de la valeur MEF exportée {1}.
it: {0}: non è possibile eseguire assegnazioni dal valore MEF {1} esportato.
ja: {0}: エクスポートされた MEF 値 {1} から割り当てることはできません。
pt_br: {0}: não pode ser atribuído por meio do valor de MEF exportado {1}.
ru: {0}: невозможно назначить из экспортированного значения MEF {1}.
tr: {0}: Dışarı aktarılan {1} MEF değerinden atanamaz.
zh_hant: {0}: 中匯出的 MEF 值 {1} 不可以指派。

source: Loop between non-shared parts.
cs: Mezi nesdílenými součástmi došlo k zacyklení.
de: Schleife zwischen nicht freigegebenen Teilen.
es: Bucle entre elementos no compartidos.
fr: Boucle entre les parties non partagées.
it: Ciclo tra parti non condivise.
ja: 共有されないパーツ間でのループ。
pt_br: Loop entre as partes não compartilhadas.
ru: Цикл между частями, которые не являются общими.
tr: Paylaşılmayan bölümler arasında döngü.
zh_hant: 非共用的組件之間的循環播放。

# LoopInvolvingImportingCtorArgumentAndAllNonLazyImports
source: Loop involving ImportingConstructor argument and all non-lazy imports.
cs: Došlo k zacyklení, které zahrnuje argument ImportingConstructor a všechny importy ze seznamu non-lazy.
de: Schleife mit ImportingConstructor-Argument und allen Non-Lazy-Importen.
es: Bucle relacionado con el argumento ImportingConstructor y todas las importaciones no perezosas.
fr: Boucle impliquant l'argument ImportingConstructor et toutes les importations non différées.
it: Ciclo che interessa l'argomento ImportingConstructor e tutte le importazioni non differite.
ja: ImportingConstructor 引数とすべての non-lazy インポートを含むループ。
pt_br: Loop envolvendo o argumento ImportingConstructor e todas as importações não lentas.
ru: Цикл, включающий аргумент ImportingConstructor и все не отложенные операции импорта.
tr: ImportingConstructor bağımsız değişkenini ve sabit olmayan tüm içeri aktarmaları içeren döngü.
zh_hant: 循環播放，牽涉到 ImportingConstructor 引數和所有的非延遲匯入。

# MetadataTypeNotSupported
source: {0}: metadata type {1} is not supported.
cs: {0}: Typ metadat {1} není podporovaný.
de: {0}: Der Metadatentyp {1} wird nicht unterstützt.
es: {0}: el tipo de metadatos {1} no es compatible.
fr: {0} : le type de métadonnées {1} n'est pas pris en charge.
it: {0}: il tipo metadati {1} non è supportato.
ja: {0}: メタデータ型 {1} はサポートされていません。
pt_br: {0}: o tipo de metadados {1} não tem suporte.
ru: {0}: тип метаданных {1} не поддерживается.
tr: {0}: Meta veri türü {1} desteklenmiyor.
zh_hant: {0}︰ 不支援中繼資料型別 {1}。

source: Not a type spec.
cs: Toto není specifikace typu.
de: Keine Typspezifikation.
es: No es una especificación de tipo.
fr: N'est pas une spécification de type.
it: Non è una specifica di tipo.
ja: 型仕様ではありません。
pt_br: Não é uma especificação de tipo.
ru: Не является спецификацией типа.
tr: Tür belirtimi değil.
zh_hant: 不是型別規格。

# NotClosedFormOfOther
source: Not a closed form of the other.
cs: Toto není uzavřená forma druhého objektu.
de: Keine geschlossene Form des anderen Elements.
es: No es una forma cerrada del otro.
fr: N'est pas une forme fermée de l'autre.
it: Non è una forma chiusa dell'altro.
ja: 他方に対する閉じたフォームではありません。
pt_br: Não é uma forma fechada do outro.
ru: Не является закрытой формой другого элемента.
tr: Diğerinin kapalı formu değil.
zh_hant: 未封閉的其他表單。

# NotGenericTypeDefinition
source: This is not a generic type definition.
cs: Toto není definice generického typu.
de: Dies ist keine generische Typdefinition.
es: No es una definición de tipo genérica.
fr: Il ne s'agit pas d'une définition de type générique.
it: Questa non è una definizione di tipo generica.
ja: これはジェネリック型定義ではありません。
pt_br: Esta não é uma definição de tipo genérico.
ru: Это не определение универсального типа.
tr: Bu, bir genel tür tanımı değil.
zh_hant: 這不是泛型型別定義。

source: Not initialized.
cs: Není inicializovaný.
de: Nicht initialisiert.
es: No se inicializó.
fr: Non initialisé.
it: Non inizializzato.
ja: 初期化されていません。
pt_br: Não inicializado.
ru: Не инициализировано.
tr: Başlatılmadı.
zh_hant: 未初始化。

source: Part is not shared.
cs: Část není sdílená.
de: Teil ist nicht freigegeben.
es: El elemento no está compartido.
fr: La partie n'est pas partagée.
it: La parte non è condivisa.
ja: パーツは共有されていません。
pt_br: A parte não é compartilhada.
ru: Часть не является общей.
tr: Bölüm paylaşılmıyor.
zh_hant: 不共用組件。

source: Unresolvable metadata token.
cs: Nedá se rozpoznat token metadat.
de: Nicht auflösbares Metadatentoken.
es: Token de metadatos irresoluble.
fr: Jeton de métadonnées ne pouvant pas être résolu.
it: Token metadati non risolvibile.
ja: 解決できないメタデータ トークンです。
pt_br: Token de metadados não resolvido.
ru: Неразрешимый токен метаданных.
tr: Çözümlenemeyen meta veri belirteci.
zh_hant: 無法解析的中繼資料語彙基元。

source: Wrong length.
cs: Nesprávná délka
de: Falsche Länge.
es: Longitud errónea.
fr: Longueur incorrecte.
it: Lunghezza errata.
ja: 長さが正しくありません。
pt_br: Comprimento incorreto.
ru: Неправильная длина.
tr: Yanlış uzunluk.
zh_hant: 錯誤的長度。

# RecursiveRequestForPartConstruction
source: Unable to construct MEF part "{0}" due to an unresolvable recursive construction request.
cs: Nelze konstruovat část MEF {0} kvůli neřešitelné žádosti o rekurzivní konstrukci.
de: Das MEF-Part "{0}" kann aufgrund einer nicht auflösbaren rekursiven Konstruktionsanforderung nicht erstellt werden.
es: No se puede construir la parte "{0}" de MEF debido a una solicitud de construcción recursiva que no se puede resolver.
fr: Impossible de construire la partie MEF "{0}" en raison d'une requête de construction récursive insoluble.
it: Non è possibile costruire la parte MEF "{0}" a causa di una richiesta di costruzione ricorsiva non risolvibile.
ja: MEF パーツ "{0}" を作成できません。再帰的構築要求を解決できません。
pt_br: Não foi possível construir a parte "{0}" do MEF devido a uma solicitação de construção recursiva não resolvida.
ru: Не удалось создать часть MEF "{0}" из-за неразрешимого рекурсивного запроса на создание.
tr: Çözümlenemeyen özyinelemeli bir oluşturma isteği nedeniyle MEF bölümü "{0}" oluşturulamıyor.
zh_hant: 無法建構 MEF 組件"{0}"因為無法解析的遞迴的建構要求。

source: AssemblyName must be set first.
cs: Nejdřív je potřeba nastavit parametr AssemblyName.
de: AssemblyName muss zuerst festgelegt werden.
es: AssemblyName debe establecerse primero.
fr: AssemblyName doit être défini en premier.
it: È prima necessario impostare AssemblyName.
ja: 最初に AssemblyName を設定する必要があります。
pt_br: O NomeDoAssembly deve ser definido primeiro.
ru: Сначала необходимо задать AssemblyName.
tr: Önce AssemblyName değeri ayarlanmalıdır.
zh_hant: 必須先設定 AssemblyName。

source: Cannot be empty.
cs: Nemůže být prázdný.
de: Darf nicht leer sein.
es: No puede estar vacío.
fr: Ne peut pas être vide.
it: Non può essere vuoto.
ja: 空にすることはできません。
pt_br: Não pode ficar em branco.
ru: Не может быть пустым.
tr: Boş olamaz.
zh_hant: 不可為空白。

# CollectionMustBePublicAndPublicCtorWhenUsingImportingCtor
source: Collection must be public with a public constructor when used with an [ImportingConstructor].
cs: Při použití s [ImportingConstructor] musí být kolekce veřejná s veřejným konstruktorem.
de: Die Sammlung muss bei Verwendung mit einem [ImportingConstructor] öffentlich mit einem öffentlichen Konstruktor sein.
es: La colección debe ser pública con un constructor público cuando se usa con un [ImportingConstructor].
fr: La collection doit être publique avec un constructeur public quand elle est utilisée avec [ImportingConstructor].
it: La raccolta deve essere pubblica con un costruttore pubblico se viene usata con un elemento [ImportingConstructor].
ja: コレクションは、[ImportingConstructor] で使用する場合には、パブリック コンストラクターと共に一般公開されている必要があります。
pt_br: A coleção deve ser pública, com um construtor público quando usado com um [ConstrutorDeImportação].
ru: Коллекция должна быть общей, с общим конструктором, если он используется с атрибутом [ImportingConstructor].
tr: Bir [ImportingConstructor] ile birlikte kullanıldığında, koleksiyon genel bir oluşturucu içermeli ve genel olmalıdır.
zh_hant: 集合必須具有公用建構函式與 [ImportingConstructor] 搭配使用時。

# CompilerErrorsOccurred
source: Compilation errors occurred.
cs: Došlo k chybám kompilace.
de: Fehler bei der Kompilierung.
es: Se produjeron errores de compilación.
fr: Des erreurs de compilation se sont produites.
it: Si sono verificati errori di compilazione.
ja: コンパイル エラーが発生しました。
pt_br: Ocorreram erros de compilação.
ru: Произошли ошибки компиляции.
tr: Derleme hataları oluştu.
zh_hant: 發生編譯錯誤。

# CustomImportSourceNotSupported
source: Custom import sources are not yet supported.
cs: Vlastní zdroje pro import ještě nejsou podporované.
de: Benutzerdefinierte Importquellen werden noch nicht unterstützt.
es: Los orígenes de importación personalizados aún no son compatibles.
fr: Les sources d'importation personnalisées ne sont pas encore prises en charge.
it: Le origini importazione personalizzate non sono ancora supportate.
ja: カスタム インポート ソースは現在サポートされていません。
pt_br: Ainda não há suporte para fontes de importação personalizadas.
ru: Пользовательские источники импорта еще не поддерживаются.
tr: Özel içeri aktarma kaynakları henüz desteklenmiyor.
zh_hant: 還不支援自訂的匯入來源。

# DiscoveredIdenticalPropertiesInMetadataAttributesForPart
source: Member "{0}" contains metadata attributes with an identical property name. Property name: "{1}".
cs: Člen {0} obsahuje atributy metadat se stejným názvem vlastnosti. Název vlastnosti: "{1}".
de: Das Element "{0}" enthält Metadatenattribute mit einem identischen Eigenschaftennamen. Name der Eigenschaft: "{1}.
es: El miembro "{0}" contiene los atributos de metadatos con un nombre de propiedad idéntico. Nombre de la propiedad: "{1}".
fr: Le membre "{0}" contient des attributs de métadonnées avec un nom de propriété identique. Nom de la propriété : "{1}".
it: Il membro "{0}" contiene attributi dei metadati con lo stesso nome di proprietà. Nome di proprietà: "{1}".
ja: メンバー "{0}" に同じプロパティ名のメタデータ属性が含まれています。プロパティ名: "{1}"。
pt_br: O membro "{0}" contém atributos de metadados com um nome de propriedade idêntico. Nome da propriedade: "{1}".
ru: Член "{0}" содержит атрибуты метаданных с идентичным именем свойства. Имя свойства: "{1}".
tr: "{0}" adlı üye, aynı özellik adına sahip meta veri öznitelikleri içeriyor. Özellik adı: "{1}".
zh_hant: 成員 "{0}" 包含屬性名稱相同的中繼資料屬性。屬性名稱: "{1}"。

# ExportsOnMembersNotAllowedWhenDeclaringTypeGeneric
source: Exports on members not allowed when the declaring type is generic.
cs: Pokud je deklarující typ generický, exporty u členů nejsou povolené.
de: Exporte von Membern sind nicht zulässig, wenn der deklarierende Typ generisch ist.
es: Exporta en miembros no permitidos cuando el tipo declarativo es genérico.
fr: Les exportations basées sur les membres ne sont pas autorisées quand le type déclarant est générique.
it: Le esportazioni su membri non sono consentite quando il tipo dichiarante è generico.
ja: 宣言する型がジェネリックの場合、メンバー上のエクスポートは許可されていません。
pt_br: Não são permitidas exportações em membros quando o tipo de declaração é genérico.
ru: Операции экспорта в элементах запрещены, если объявляющий тип является универсальным.
tr: Bildirim türü genel olduğunda, üyelere dışarı aktarmaya izin verilmez.
zh_hant: 宣告的型別是泛型時，不允許的成員上的匯出。

source: Failed to generate embeddable types.
cs: Nepovedlo se generovat typy umožňující vložení.
de: Fehler beim Generieren einbettbarer Typen.
es: Se produjo un error al generar tipos insertables.
fr: Échec de la génération des types incorporables.
it: Non è stato possibile generare tipi incorporabili.
ja: 埋め込み可能な型を生成できませんでした。
pt_br: Falha ao gerar tipos que permitem inserção.
ru: Не удалось создать встраиваемые типы.
tr: Eklenebilir türler oluşturulamadı.
zh_hant: 無法產生內嵌的型別。

# ImportConstraintTypeNotSupported
source: The import constraint type {0} is not supported.
cs: Typ omezení importu {0} není podporovaný.
de: Der Importeinschränkungstyp {0} wird nicht unterstützt.
es: El tipo de restricción de importación {0} no es compatible.
fr: Le type de contrainte d'importation {0} n'est pas pris en charge.
it: Il tipo di vincolo di importazione {0} non è supportato.
ja: インポートの制約型 {0} がサポートされていません。
pt_br: O tipo de restrição de importação {0} não tem suporte.
ru: Тип ограничения импорта {0} не поддерживается.
tr: İçeri aktarma kısıtlama türü {0} desteklenmiyor.
zh_hant: 不支援匯入條件約束型別 {0}。

# IsExpectedOnlyOnImportsOfExportFactoryOfT
source: {0} is expected only on imports of ExportFactory<T>.
cs: {0} se očekává jenom u importů třídy ExportFactory<T>.
de: {0} wird nur bei Importen von ExportFactory<T> erwartet.
es: {0} solo se espera en importaciones de ExportFactory<T>.
fr: {0} est attendu uniquement sur les importations de ExportFactory<T>.
it: {0} è previsto sono su importazioni di ExportFactory<T>.
ja: {0} は、 ExportFactory<T> をインポートする場合にのみ必要です。
pt_br: {0} é esperado somente em importações da FábricaDeExportação<T>.
ru: {0} ожидается только при импорте ExportFactory<T>.
tr: {0} yalnızca ExportFactory<T> içeri aktarmalarında beklenir.
zh_hant: 只有在匯入 ExportFactory<T> 時才需要 {0}。

# IsExportFactoryExpectedTrue
source: IsExportFactory is expected to be true.
cs: Očekává se, že IsExportFactory bude mít hodnotu True.
de: Für IsExportFactory wird "true" erwartet.
es: Se espera que IsExportFactory sea verdadero.
fr: IsExportFactory est censé avoir la valeur true.
it: IsExportFactory deve essere true.
ja: IsExportFactory が true である必要があります。
pt_br: Espera-se que IsExportFactory seja true.
ru: Для IsExportFactory требуется значение true.
tr: IsExportFactory değerinin true olması bekleniyor.
zh_hant: IsExportFactory 必須為 true。

# MemberContainsBothImportAndImportMany
source: Member "{0}" contains both ImportAttribute and ImportManyAttribute.
cs: Člen {0} obsahuje třídu ImportAttribute i ImportManyAttribute.
de: Member "{0}" enthält sowohl ImportAttribute als auch ImportManyAttribute.
es: El miembro "{0}" contiene tanto ImportAttribute como ImportManyAttribute.
fr: Le membre "{0}" contient à la fois ImportAttribute et ImportManyAttribute.
it: Il membro "{0}" contiene sia ImportAttribute che ImportManyAttribute.
ja: メンバー "{0}" には、ImportAttribute と ImportManyAttribute の両方が含まれます。
pt_br: O membro "{0}" contém tanto o AtributoImportar quanto o AtributoImportarMuitos.
ru: Элемент "{0}" содержит атрибуты ImportAttribute и ImportManyAttribute.
tr: "{0}" üyesi hem ImportAttribute hem de ImportManyAttribute içeriyor.
zh_hant: 成員"{0}"包含 ImportAttribute 及 ImportManyAttribute。

source: No importing constructor found.
cs: Nenašel se žádný importující konstruktor.
de: Es wurde kein importierender Konstruktor gefunden.
es: No se encontró ningún constructor de importación.
fr: Constructeur d'importation introuvable.
it: Non sono stati trovati costruttori di importazione.
ja: インポート コンストラクターが見つかりません。
pt_br: Nenhum construtor de importação encontrado.
ru: Не удалось найти конструктор импорта.
tr: İçeri aktarma oluşturucusu bulunamadı.
zh_hant: 沒有找到匯入建構函式。

source: No member to satisfy.
cs: Nedá se splnit u žádného člena.
de: Es wurde kein Member gefunden, dessen Bedingungen erfüllt werden können.
es: No hay ningún miembro que satisfacer.
fr: Aucun membre à respecter.
it: Non ci sono membri da soddisfare.
ja: 要件を満たすメンバーがありません。
pt_br: Nenhum membro a satisfazer.
ru: Отсутствуют соответствующие элементы.
tr: Karşılanacak üye yok.
zh_hant: 要滿足沒有成員。

# OnImportsSatisfiedTakeNoParameters
source: OnImportsSatisfied method should take no parameters.
cs: Metoda OnImportsSatisfied by neměla mít žádné parametry.
de: Die OnImportsSatisfied-Methode darf keine Parameter verwenden.
es: El método OnImportsSatisfied no debería llevar parámetros.
fr: La méthode OnImportsSatisfied ne doit accepter aucun paramètre.
it: Il metodo OnImportsSatisfied non deve accettare parametri.
ja: OnImportsSatisfied メソッドは、パラメーターを取りません。
pt_br: O método OnImportsSatisfied não deve conter nenhum parâmetro.
ru: Метод OnImportsSatisfied не должен принимать параметры.
tr: OnImportsSatisfied yöntemi parametre almamalıdır.
zh_hant: OnImportsSatisfied 方法應該不採用參數。

source: Only one OnImportsSatisfied method is supported.
cs: Podporovaná je jenom jedna metoda OnImportsSatisfied.
de: Es wird nur eine OnImportsSatisfied-Methode unterstützt.
es: Solo es compatible el método OnImportsSatisfied.
fr: Seule une méthode OnImportsSatisfied est prise en charge.
it: È supportato un solo metodo OnImportsSatisfied.
ja: サポートされている OnImportsSatisfied メソッドは 1 つだけです。
pt_br: Somente um método OnImportsSatisfied tem suporte.
ru: Поддерживается только метод OnImportsSatisfied.
tr: Yalnızca bir OnImportsSatisfied yöntemi desteklenir.
zh_hant: 支援只有一個 OnImportsSatisfied 方法。

source: Only supported on write operations.
cs: Podporované jenom u operací zápisu.
de: Wird nur bei Schreibvorgängen unterstützt.
es: Solo es compatible en las operaciones de escritura.
fr: Prise en charge assurée uniquement sur les opérations d'écriture.
it: Supportato solo su operazioni di scrittura.
ja: 書き込み操作でのみサポートされます。
pt_br: Com suporte somente em operações de gravação.
ru: Поддерживается только в операциях записи.
tr: Yalnızca yazma işlemlerinde desteklenir.
zh_hant: 只支援寫入作業。

source: Readable stream required.
cs: Je vyžadovaný stream s možností čtení.
de: Ein lesbarer Stream ist erforderlich.
es: Es necesaria una secuencia legible.
fr: Flux accessible en lecture nécessaire.
it: È richiesto un flusso leggibile.
ja: 読み取り可能なストリームが必要です。
pt_br: Fluxo legível necessário.
ru: Требуется поток, доступный для чтения.
tr: Okunabilir akış gerekli.
zh_hant: 所需的可讀取資料流。

# TypeMustDefineMemberInfoOrDerivedType
source: Type must be the one that defines memberInfo or a derived type.
cs: Typ musí být takový, který definuje třídu memberInfo nebo odvozený typ.
de: Der Typ muss dem Typ entsprechen, der memberInfo definiert, oder einem davon abgeleiteten Typ.
es: El tipo debe definir memberInfo o un tipo derivado.
fr: Le type doit être celui qui définit memberInfo ou un type dérivé.
it: Il tipo deve essere quello che definisce memberInfo o un tipo derivato.
ja: memberInfo または派生型を定義する型でなければなりません。
pt_br: O tipo deve ser aquele que define as InformaçõesDoMembro ou um tipo derivado.
ru: Тип должен определять memberInfo или производный тип.
tr: Tür, memberInfo'yu tanımlamalı veya türetilmiş tür olmalıdır.
zh_hant: 型別必須是一個定義 memberInfo 或衍生的型別。

# UnexpectedConstraintType
source: Unexpected constraint type: {0}.
cs: Neočekávaný typ omezení: {0}.
de: Unerwarteter Einschränkungstyp: {0}.
es: Tipo de restricción no esperado: {0}.
fr: Type de contrainte inattendu : {0}.
it: Tipo di vincolo imprevisto: {0}.
ja: 予期しない制約型: {0}。
pt_br: Tipo de restrição inesperado: {0}.
ru: Неожиданный тип ограничения: {0}.
tr: Beklenmeyen kısıtlama türü: {0}.
zh_hant: 未預期的條件約束型別︰ {0}。

# UnsupportedFormat
source: Unsupported format: {0}.
cs: Nepodporovaný formát: {0}.
de: Nicht unterstütztes Format: {0}.
es: Formato no compatible: {0}.
fr: Format non pris en charge : {0}.
it: Formato non supportato: {0}.
ja: サポートされない形式: {0}。
pt_br: Formato sem suporte: {0}.
ru: Неподдерживаемый формат: {0}.
tr: Desteklenmeyen biçim: {0}.
zh_hant: 不支援的格式: {0}。

source: Writable stream required.
cs: Je vyžadovaný stream s možností zápisu.
de: Ein schreibbarer Stream ist erforderlich.
es: Es necesaria una secuencia grabable.
fr: Flux accessible en écriture nécessaire.
it: È richiesto un flusso accessibile in scrittura.
ja: 書き込み可能なストリームが必要です。
pt_br: Fluxo gravável necessário.
ru: Требуется поток, доступный для записи.
tr: Yazılabilir akış gerekli.
zh_hant: 所需的可寫入資料流。

source: Wrong type.
cs: Nesprávný typ
de: Falscher Typ.
es: Tipo incorrecto.
fr: Type incorrect.
it: Tipo errato.
ja: 型が正しくありません。
pt_br: Tipo incorreto.
ru: Неправильный тип.
tr: Yanlış tür.
zh_hant: 錯誤的型別。
